app/controllers/roomates_controller.rb

SELECT `users`.* FROM `users`
---
  def index
  	@roomates = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@CurrentRoomate = User.find(params[:id])