app/controllers/sign_in_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO `users` (`firstName`, `middleName`, `lastName`, `age`, `city`, `email`, `username`, `password`, `created_at`, `updated_at`) VALUES ('Charles', 'Oliver', 'Enberg', '22', 'New York', 'cenberg@gmail.com', 'saralavilover', 'cats123', '2017-06-29 18:51:49', '2017-06-29 18:51:49')